// Имя
let name = prompt("Введите ваше имя");
console.log("Ваше имя: " + name);

// Возраст
let age = prompt("Введите ваш возраст");
console.log("Ваш возраст: " + age);

// Пример 1
let p1 = prompt("Решите пример: 20 + 12");
console.log("Пример 1:\n20 + 12  = 32. \nВаш ответ " + p1);

// Пример 2
let p2 = prompt("Решите пример: 10 * 76");
console.log("Пример 2:\n10 * 76  = 760. \nВаш ответ " + p2);

// Пример 3
let p3 = prompt("Решите пример: (36 + 12) / 6");
console.log("Пример 3:\n(36 + 12) / 6 = 8. \nВаш ответ " + p3);

// Пример 4
let p4 = prompt("Решите пример: 12 % 5");
console.log("Пример 4:\n12 % 5 = 2. \nВаш ответ " + p4);

// Пример 5
let p5 = prompt("Решите пример: 45 / 5 * 3 + 2");
console.log("Пример 3:\n45 / 5 * 3 + 2 = 29. \nВаш ответ " + p5);

// Консоль
prompt("Зайдите в консоль для просмотра");
